posts/2016-09-17-friends-in-the-darkness.org
#+date: <2016-09-17>
#+filetags: prayer religion
#+title: Friends in the Darkness

I'm sitting in the USO at the Portland airport with some time to write the prayer for the week. The week of 9/11 is always a time of reflection for me. In past years, I've generally thought about the cost to military families, compared to a country that mostly feels inconvenienced at the airport. This year, I thought instead about the wonderful friends I made during two deployments. Although I do wish that the conflict had never happened, those friends are gifts from God that I will always cherish.

This week's prayer:

Thank you for\\
the precious ones\\
who walk through\\
the valleys with us,\\
surrounding us\\
with your love,\\
and reminding us\\
that your grace can\\
redeem every moment.

/Amen/






#+begin_tagline
Tagged: prayer religion
#+end_tagline
