docs/posts/2016-09-17-friends-in-the-darkness.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Dec 23, 2024 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Friends in the Darkness</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
<link rel='stylesheet' href='/css/syntax-coloring.css' type='text/css'/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="/"> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/index.xml">RSS</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">Friends in the Darkness</h1>
<p class="subtitle" role="doc-subtitle">Sep 17, 2016</p>
</header><p>
I&rsquo;m sitting in the USO at the Portland airport with some time to write the prayer for the week. The week of 9/11 is always a time of reflection for me. In past years, I&rsquo;ve generally thought about the cost to military families, compared to a country that mostly feels inconvenienced at the airport. This year, I thought instead about the wonderful friends I made during two deployments. Although I do wish that the conflict had never happened, those friends are gifts from God that I will always cherish.
</p>

<p>
This week&rsquo;s prayer:
</p>

<p>
Thank you for<br>
the precious ones<br>
who walk through<br>
the valleys with us,<br>
surrounding us<br>
with your love,<br>
and reminding us<br>
that your grace can<br>
redeem every moment.
</p>

<p>
<i>Amen</i>
</p>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Dec 23, 2024.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
